ConnectTest/src/InformationRegisters/providedServices/providedServices.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>providedServices</name>
  <resources>
    <name>services</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>registrationDate</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>employe</name>
    <type>
      <types>CatalogRef.employees</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ConnectTest/src/InformationRegisters/providedServices/ManagerModule.bsl
Function attributesStructure() Export

	attributesTable = data.getValueTable();
	attributesTableForNewItem = data.getValueTable();

	data.addRowInAttributesTable(attributesTable, "employe", "employe", "ref");
	data.addRowInAttributesTable(attributesTable, "services", "services", "JSON");

	employeStruct = New Structure();
	employeStruct.Insert("employees", "uid");

	mdStruct = New Structure();
	mdStruct.Insert("employe", employeStruct);

	Return New Structure("mdObjectName, mdType, actType, attributesTable, attributesTableForNewItem, mdStruct", "providedServices", "informationRegister", "write", attributesTable, attributesTableForNewItem, mdStruct);

EndFunction
